{"modelTopology": {"training_config": {"metrics": ["acc"], "loss": "mse", "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_16", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "batch_input_shape": [null, 4], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_17", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_18", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_6"}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 128], "name": "dense_16/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_16/bias"}, {"dtype": "float32", "shape": [128, 128], "name": "dense_17/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_17/bias"}, {"dtype": "float32", "shape": [128, 1], "name": "dense_18/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_18/bias"}]}]}